[
  {
    "id": "wih-001",
    "trigger": "Everything feels too bright or loud",
    "normalization": "Heightened sensory sensitivity is a known psilocybin response. It's temporary.",
    "action": "Move to a dimmer, quieter space. If you can't move, close your eyes and cover your ears gently.",
    "timeline": "Typically settles within 20-40 minutes.",
    "escalation": "breathe"
  },
  {
    "id": "wih-002",
    "trigger": "I feel anxious or panicky",
    "normalization": "Anxiety during onset is common, especially with a new batch or higher dose. Your body is adjusting.",
    "action": "Place both hands on a cold surface. Press firmly. Focus on the temperature and pressure.",
    "timeline": "Acute anxiety usually peaks at 30-45 minutes and subsides by 90 minutes.",
    "escalation": "breathe"
  },
  {
    "id": "wih-003",
    "trigger": "I can't tell if I'm feeling something",
    "normalization": "The threshold zone between sub-perceptual and perceptual is ambiguous by definition. That's the territory we're mapping.",
    "action": "Stop looking for effects. Do something you'd normally do. Check back in 30 minutes.",
    "timeline": "If nothing after 90 minutes, this dose was likely sub-threshold for you today.",
    "escalation": null
  },
  {
    "id": "wih-004",
    "trigger": "I feel disconnected from my body",
    "normalization": "Dissociative feelings can occur, especially at higher thresholds. You're safe.",
    "action": "Press your feet into the floor. Wiggle your toes. Squeeze your hands into fists, then release.",
    "timeline": "Body reconnection usually happens within 15-30 minutes with grounding.",
    "escalation": "ground"
  },
  {
    "id": "wih-005",
    "trigger": "My thoughts are racing",
    "normalization": "Increased thought speed is a common cognitive effect. It's not dangerous, but it can feel overwhelming.",
    "action": "Pick one thought. Say it out loud. Let the rest go for now.",
    "timeline": "Racing thoughts typically slow within 30-60 minutes.",
    "escalation": "breathe"
  },
  {
    "id": "wih-006",
    "trigger": "I feel emotional or tearful",
    "normalization": "Emotional openness is one of psilocybin's most well-documented effects. Tears are a release, not a problem.",
    "action": "Let it happen. You don't need to understand it right now. If you want, place a hand on your chest.",
    "timeline": "Emotional waves pass. They always do. Usually within 20-40 minutes.",
    "escalation": null
  },
  {
    "id": "wih-007",
    "trigger": "I feel nauseous",
    "normalization": "Nausea is common with psilocybin, especially on an empty or full stomach. It's your gut, not your mind.",
    "action": "Sip room-temperature water. Ginger helps if available. Lie on your left side if you can.",
    "timeline": "Nausea typically passes within 30-45 minutes of onset.",
    "escalation": null
  },
  {
    "id": "wih-008",
    "trigger": "Time feels strange",
    "normalization": "Time dilation or compression is a common perceptual shift. Clocks still work even when time doesn't feel normal.",
    "action": "Set a timer for 10 minutes. When it goes off, you'll have proof that time is still passing normally.",
    "timeline": "Time perception normalizes as effects plateau, usually within 60-90 minutes.",
    "escalation": null
  },
  {
    "id": "wih-009",
    "trigger": "I'm having difficulty with people around me",
    "normalization": "Social sensitivity increases with psilocybin. Other people's energy can feel louder.",
    "action": "It's okay to leave the room. You don't owe anyone an explanation. Find a quiet space.",
    "timeline": "Social sensitivity is dose-dependent. Lower thresholds = less impact.",
    "escalation": "ground"
  },
  {
    "id": "wih-010",
    "trigger": "I feel amazing and want to take more",
    "normalization": "This is important to hear right now: the urge to redose during a positive experience is common but almost always leads to overshooting.",
    "action": "Do not redose. Write down how you feel instead. This is data. Log the dose amount — this might be your sweet spot.",
    "timeline": "Log this dose. If it's consistently this good, you've found your sweet spot. Redosing would move you past it.",
    "escalation": null
  },
  {
    "id": "wih-011",
    "trigger": "I think I took too much",
    "normalization": "If you're reading this, you're oriented enough to use a phone. That's a good sign. You're going to be fine.",
    "action": "Go to Settle Mode. Start with breathing. You don't have to do anything except wait. Effects will diminish.",
    "timeline": "Psilocybin effects peak at 60-90 minutes and diminish over 3-4 hours. You will come down.",
    "escalation": "breathe"
  },
  {
    "id": "wih-012",
    "trigger": "I need to talk to someone",
    "normalization": "Wanting support is not weakness. It's wisdom.",
    "action": "Call your emergency contact. If you don't have one, Fireside Project provides free psychedelic peer support: 62-FIRESIDE (623-473-7433).",
    "timeline": null,
    "escalation": "emergency"
  }
]
